app/Controllers/EstudiantesController.php

SELECT *
FROM `estudiantes`
---
    public function index(): string
    {
        $estudiantes = new EstudiantesModel();
        $query = $this->request->getGet('query');
        if ($query) {
            $datos['estudiantes'] = $estudiantes->like('carne_alumno', $query)
                                                ->orLike('nombre', $query)
                                                ->orLike('apellido', $query)
                                                ->findAll();
        } else {


        $datos['estudiantes'] = $estudiantes->findAll();