app/Controllers/MaestrosController.php

    public function index()
    {

        $maestros = new MaestrosModel();

        $datos ['datos'] = $maestros->findAll();
---
SELECT *
FROM `maestros`

    public function agregarMaestro()
    {

        $maestros = new MaestrosModel();


        $datos = [
            'nombre' => $this->request->getPost('txt_nombre'),
            'apellido' => $this->request->getPost('txt_apellido'),
            'direccion' => $this->request->getPost('txt_direccion'),
            'email' => $this->request->getPost('txt_email')
        ];

        $maestros->insert($datos);
---
INSERT INTO `maestros` (`nombre`, `apellido`, `direccion`, `email`) VALUES ('Josué', 'Rivas', '61 Calle 14-17 Sacoj Chiquito Zona 6 Mixco', 'holipepe@jiji.com')

    public function eliminarMaestro($codigo_maestro)
    {

        $maestros = new MaestrosModel();


        $maestros->delete($codigo_maestro);
---
DELETE FROM `maestros`
WHERE `codigo_maestro` IN ('1007')

    public function buscarMaestro($codigo_maestro)
    {
        $maestros = new MaestrosModel();

        $datos['maestro'] = $maestros->find($codigo_maestro);
---
SELECT *
FROM `maestros`
WHERE `maestros`.`codigo_maestro` = '0'