app/Controllers/MateriasController.php

    public function index()
    {

        $materias = new MateriasModel();
        $maestros = new MaestrosModel();



        $datos['materias'] = $materias
            ->select('materias.*, maestros.nombre as nombre_maestro, maestros.apellido as apellido_maestro')
            ->join('maestros', 'maestros.codigo_maestro = materias.codigo_maestro', 'left') // LEFT JOIN para incluir materias sin maestro (NULL)
            ->findAll();


        $datos['maestros'] = $maestros->findAll();
---
SELECT `materias`.*, `maestros`.`nombre` as `nombre_maestro`, `maestros`.`apellido` as `apellido_maestro`
FROM `materias`
LEFT JOIN `maestros` ON `maestros`.`codigo_maestro` = `materias`.`codigo_maestro`
SELECT *
FROM `maestros`

  public function agregarMateria()
    {
        $materias = new MateriasModel();

        $codigo_maestro = $this->request->getPost('ddl_codigo_maestro');

        $maestro_id_para_db = ($codigo_maestro) ? $codigo_maestro : null;

        $datos_a_insertar = [
            'codigo_maestro' => $maestro_id_para_db,
            'nombre_materia' => $this->request->getPost('txt_nombre_materia')
        ];


        $materias->insert($datos_a_insertar);
---
INSERT INTO `materias` (`codigo_maestro`, `nombre_materia`) VALUES ('1001', 'Computacion')

    public function editarMateria($codigo_materia)
    {
        $materiasModel = new MateriasModel();
        $maestrosModel = new MaestrosModel();


        $materia = $materiasModel->find($codigo_materia);

        if (!$materia) {
            session()->setFlashdata('msg_error', 'Materia no encontrada.');
            return redirect()->to(base_url('materias'));
        }


        $data['materia'] = $materia;
        $data['maestros'] = $maestrosModel->findAll();
---
SELECT *
FROM `materias`
WHERE `materias`.`codigo_materia` = '102'
SELECT *
FROM `maestros`