app/Controllers/UsuariosController.php

    public function index()
    {
        $email = $this->request->getPost('txt_usuario');
        $contra = $this->request->getPost('txt_contra');

        // 1. Instanciar el modelo para interactuar con la DB
        $usuarios = new UsuariosModel();

        // 2. Buscar al usuario en la base de datos, incluyendo el carné
        $datos = $usuarios->select('nombre, tipo_usuario_id, carne_alumno')
            ->where('email', $email)
            ->where('password', $contra)
            ->first();
---
SELECT `nombre`, `tipo_usuario_id`, `carne_alumno`
FROM `usuarios`
WHERE `email` = 'helary@mail.com'
AND `password` = 'helary123'
 LIMIT 1